Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/law_and_rights/access_to_garda_records.html.txt.tmx
Source language: en
Languages: ga

source: Access to Garda records
ga: Rochtain ar thaifid na nGardaí

source: The Garda Síochána (the national police force) hold a large volume of records in relation to individual members of society
ga: Tá an-chuid taifid ag na Gardaí Síochána (an fórsa póilíneachta náisiúnta) maidir le baill aonair den tsochaí

source: These records are gathered and stored as part of the main function of the Gardaí; that is, to investigate and detect crime, to protect life and property and to prevent crime
ga: Déantar na taifid seo a bhailiú agus a stóráil mar chuid de phríomhfheidhm na nGardaí; sé sin, cionta a imscrúdú agus a bhrath, beatha agus maoin a chosaint agus cionta a chosc

source: The Data Protection Acts 1998 to 2003 confer rights on you to access certain information (on computer, in manual or paper files) about you which is held by the Gardaí
ga: Bronnann na hAchtanna um Chosaint Sonraí 1998 go 2003 cearta ort rochtain a fháil ar roinnt faisnéise fút (ar ríomhaire, i lámhleabhar nó comhaid ar pháipéar) atá á choinneáil ag na Gardaí

source: An example of this information would be any entry by the Gardaí on the Garda PULSE system (the Garda computer system), or in Garda investigation files
ga: Is sampla den fhaisnéis seo ná aon iontráil ag na Gardaí ar chóras PULSE na nGardaí (córas ríomhaireachta na nGardaí), nó i gcomhaid imscrúdaithe na nGardaí

source: Can I access any data being held on me by the Gardaí?
ga: An féidir liom rochtain a fháil ar aon sonraí atá á gcoinneáil fúm ag na Gardaí?

source: Yes, but there are a number of restrictions on the data you may access
ga: Is féidir, ach tá roinnt srianta ar na sonraí gur féidir leat rochtain a fháil orthu

source: Section 4 of the Data Protection Act allows you to make a request to the Gardaí for a copy of any of your personal data being kept by them
ga: Ligeann alt 4 den Acht um Chosaint Sonraí duit iarratas a dhéanamh ar na Gardaí ar chóip d'aon sonraí pearsanta atá á choinneáil acu maidir leat

source: On making an access request to the Gardaí, you are entitled to:
ga: Tar éis iarratas rochtana a dhéanamh ar na Gardaí, tá tú i dteideal na rudaí seo a leanas:

source: • A copy of the data being kept about you
ga: • Cóip a fháil de na sonraí atá á gcoinneáil fút

source: • A copy of any data held about you which is an opinion (except where such opinions were given in confidence)
ga: • Cóip a fháil d'aon sonraí atá á gcoinneáil fút nuair is tuairim atá iontu (ach amháin más rud é gur tugadh na tuairimí sin faoi rún)

source: • Know the purpose for which the data is being kept
ga: • Fios a bheith agat cén cuspóir lena bhfuil na sonraí á choinneáil

source: • Know the identity of anyone to whom the Gardaí disclose that data
ga: • Fios a bheith agat faoi dhuine ar bith a nochtann na Gardaí na sonraí sin leo

source: • Know the source of the data (i.e
ga: • Fios a bheith agat faoi fhoinse na sonraí (.i

source: where the data came from) unless it is contrary to public interest
ga: cad as a dtáinig na sonraí) ach amháin má tá sé sin i gcoinne leas an phobail

source: You have a number of other rights under the Data Protection Acts, in addition to the right of access described above These additional rights include the right to have any inaccurate personal information about you corrected or erased and the right to complain to the Data Protection Commissioner
ga: Tá roinnt cearta eile agat faoi na hAchtanna um Chosaint Sonraí, chomh maith leis an gceart ar rochtain a dhéantar cur síos air thuas. I measc na gceart breise seo tá sé de cheart agat aon fhaisnéis phearsanta nach bhfuil cruinn a cheartú nó a scrios agus an ceart gearán a dhéanamh leis an gCoimisinéir Cosanta Sonraí

source: Once the Gardaí receive a correct request from you, they must reply to you within 40 days
ga: Tar éis do na Gardaí iarratas ceart a fháil uait, caithfidh siad freagra a thabhairt duit taobh istigh de 40 lá

source: This is the case even if they do not hold any of your personal data or they are refusing the request
ga: Is amhlaidh atá fiú mura bhfuil aon sonraí pearsanta fút á gcoinneáil acu nó má tá siad ag diúltú don iarratas

source: If the Gardaí decide that the information is to be provided to you, they must:
ga: Má chinneann na Gardaí go gcuirfear an fhaisnéis ar fáil duit, caithfidh siad:

source: • Supply the information to you within 40 days of receiving your request
ga: • An fhaisnéis a sholáthar duit taobh istigh de 40 lá ón uair a fhaigheann siad d'iarratas

source: • Provide the information in a manner or form which will be clear to you
ga: • An fhaisnéis a chur ar fáil duit ar bhealach nó i bhfoirm a bheidh soiléir duit

source: If you request a copy of your criminal record, the record will be provided in 2 parts, with spent convictions provided separately from the other convictions (if any)
ga: Má iarrann tú cóip de do thaifead coiriúil, beidh an taifead a chur ar fáil i 2 chuid, le ciontuithe chaith ar fáil ar leithligh ó na ciontuithe eile (más ann)

source: Why can the Gardaí refuse my request?
ga: Cén fáth ar féidir leis na Gardaí m'iarratas a dhiúltú?

source: Under the Data Protection Acts, the Gardaí can refuse any request for personal data and can withhold that information on the following grounds:
ga: Faoi na hAchtanna um Chosaint Sonraí, is féidir leis na Gardaí aon iarratas ar shonraí pearsanta a dhiúltú agus an fhaisnéis sin a choinneáil siar ar na forais seo a leanas:

source: • If the access application or request for data would identify someone else
ga: • Más rud é go ndéanfadh an t-iarratas ar rochtain nó an t-iarratas ar shonraí duine eile a aithint

source: This also applies in relation to the obligation on the Gardaí to provide details of the source of the information held
ga: Bíonn feidhm aige seo freisin maidir le dualgas na nGardaí foinse na faisnéise atá á coinneáil a sholáthar

source: If the source or origin of the information identifies a third party, then it can be withheld
ga: Más rud é go ndéanann an fhoinse nó bunús na faisnéise tríú páirtí a aithint, ansin is féidir í a choinneáil siar

source: • If the personal data being kept is for the purpose of preventing, detecting or investigating crime, or for arresting or prosecuting offenders
ga: • Más rud é gurb é an cuspóir atá leis na sonraí pearsanta a choinneáil ná chun cionta a chosc, a bhrath nó a imscrúdú, nó chun ciontóirí a ghabháil nó a ionchúiseamh

source: Can somebody apply to the Gardaí for my personal data on my behalf?
ga: An féidir le duine iarratas a dhéanamh ar mo shon leis na Gardaí ar mo shonraí pearsanta?

source: The Gardaí may receive an access request by a representative on your behalf
ga: Is féidir leis na Gardaí iarratas ar rochtain a fháil ó ionadaí ar do shon

source: They will however will need to satisfy themselves as to the identity of that person and will have to be provided with enough information about you to assist in establishing identity and locating the data sought or requested
ga: Beidh orthu áfach a bheith sásta iad féin maidir le haitheantas an duine sin agus ní mór a ndóthain faisnéise a bheith curtha ar fáil dóibh fút chun cabhrú leo aitheantas a dheimhniú agus na sonraí atá á lorg nó a ndearnadh iarratas orthu a aimsiú

source: The Gardaí will require written confirmation from you, authorising your representative to make the request
ga: Beidh dearbhú i scríbhinn ag teastáil ó na Gardaí uait, ag tabhairt údarás do d'ionadaí an t-iarratas a dhéanamh

source: An example of this could be where your solicitor would be authorised by you to request the information
ga: Sampla den méid seo ná nuair a bheadh údarás tugtha agat do d'aturnae chun iarratas a dhéanamh ar an bhfaisnéis

source: Where the request is in relation to a child, then a parent or guardian can exercise the right to apply for and receive the information on behalf of the child if:
ga: Nuair a bhaineann an t-iarratas le páiste, ansin is féidir le tuismitheoir nó le caomhnóir úsáid a bhaint as an gceart chun iarratas a dhéanamh ar fhaisnéis agus í a fháil thar ceann an pháiste más rud é:

source: • The child does not have the intellectual ability to understand the nature of the request
ga: • Nach bhfuil an cumas intleachtach ag an bpáiste cineál an iarratais a thuiscint

source: • The parent or guardian is acting in the best interest of the child
ga: • Go bhfuil an tuismitheoir nó caomhnóir ag gníomhú ar son an leasa is fearr don pháiste

source: Can the Gardaí access personal data held on me by other people?
ga: An féidir leis na Gardaí rochtain a fháil ar shonraí pearsanta atá á gcoinneáil ag daoine eile maidir liom?

source: In certain circumstances, the Gardaí are entitled to access your personal data
ga: I gcúinsí áirithe, tá na Gardaí i dteideal rochtain a fháil ar do shonraí pearsanta

source: In such circumstances the person holding such personal data on you will not be in breach of the rules against disclosing personal data to third parties
ga: Sna cúinsí sin ní bheidh an duine atá ag coinneáil sonraí pearsanta mar sin ag sárú na rialacha i gcoinne sonraí pearsanta a nochtadh le tríú páirtithe

source: The following are the occasions where the Gardaí are allowed to access such personal data:
ga: Seo a leanas na huaireanta gur féidir leis na Gardaí rochtain a fháil ar shonraí pearsanta mar sin:

source: • If in the opinion of a member of the Gardaí (not below the rank of Chief Superintendent), the personal data is required for the purpose of safeguarding the security of the State
ga: • Más rud é go bhfuil na sonraí pearsanta riachtanach chun slándáil an Stáit a chosaint, i dtuairim chomhalta den Gharda Síochána (nach bhfuil faoi bhun chéim Ard-Cheannfoirt)

source: • If the personal data is required for the purpose of preventing, detecting or investigating crime or for arresting or prosecuting offenders
ga: • Más rud é go bhfuil na sonraí pearsanta ag teastáil ar mhaithe le cionta a chosc, a bhrath nó a imscrúdú, nó chun ciontóirí a ghabháil nó a ionchúiseamh

source: How do I apply to the Gardaí for my personal data?
ga: Conas iarratas a dhéanamh

source: Requests for personal data must be made in writing to the Garda Criminal Records Office
ga: Caithfear iarratais ar shonraí pearsanta a dhéanamh i scríbhinn chuig Lár-Aonad Grinnfhiosrúcháin na nGardaí

source: While it is not a requirement to mention the Data Information Acts, it is recommended that you do
ga: Cé nach gá duit na hAchtanna um Chosaint Sonraí a lua, moltar duit é sin a dhéanamh

source: You can download the Gardaí's access request form (pdf)
ga: Íoslódáil an fhoirm iarratais ar rochtain an Gharda Síochána anseo (pdf)

source: You must provide enough information to establish your identity and to allow the Vetting Unit to locate the information you request
ga: Caithfidh tú a ndóthain sonraí a sholáthar le gur féidir leis an Aonad Grinnfhiosrúcháin d'aitheantas a dheimhniú agus an fhaisnéis atá tú ag iarraidh a aimsiú

source: It is important (from the Gardaí’s point of view) that they establish your identity to ensure the information is given to the right person
ga: Tá sé tábhachtach (ó dhearcadh na nGardaí) go ndéanfaidh siad d'aitheantas a dheimhniú le bheith cinnte go dtugtar an fhaisnéis don duine ceart

source: In order to obtain your own personal data, you are required to provide the following:
ga: Chun do shonraí pearsanta féin a fháil, is gá duit an méid seo a leanas a sholáthar:

source: • Your correct date of birth
ga: • Do dháta breithe cruinn

source: • Any other names used by you
ga: • Aon ainmneacha eile a mbaineann tú úsáid astu

source: • Your current address and previous addresses in Ireland
ga: • Na seoltaí ar fad a bhí agat roimhe seo in Éirinn

source: • A copy of your passport, driving licence or birth certificate
ga: • Cóip dheimhnithe de phas, de cheadúnas tiomána nó de theastas breithe

source: What can I do if the Gardaí refuse my request?
ga: Cad is féidir liom a dhéanamh má dhiúltaíonn na Gardaí do m'iarratas?

source: If you are of the opinion that the Gardaí are in breach of the law by not giving you the personal data you requested, you can make a complaint to the Data Protection Commissioner
ga: Más dóigh leat go bhfuil na Gardaí ag sárú an dlí trí gan na sonraí pearsanta a ndearna tú iarratas orthu a thabhairt duit, is féidir leat gearán a dhéanamh leis an gCoimisinéir Cosanta Sonraí

source: The Commissioner will investigate your complaint unless they are of the opinion that the complaint is frivolous or vexatious
ga: Déanfaidh an Coimisinéir imscrúdú ar do ghearán ach amháin más dóigh leis gur gearán suaibhreosach nó cráiteach é

source: (That is, your complaint is without any foundation)
ga: (Sé sin, nach bhfuil aon bhunús le do ghearán)

source: As soon as the Data Protection Commissioner has investigated your complaint, you will be notified in writing of the decision
ga: Chomh luath agus a dhéanann an Coimisinéir Cosanta Sonraí do ghearán a imscrúdú, cuirfear ar an eolas faoin gcinneadh i scríbhinn thú

source: If the Data Protection Commissioner is of the opinion that the Gardaí are in breach of the Act, the Commissioner may serve what is called an enforcement notice on the Garda Commissioner and make the Gardaí hand over to you the information you requested
ga: Más dóigh leis an gCoimisinéir go bhfuil na Gardaí ag sárú an Achta, is féidir leis an gCoimisinéir rud ar a dtugtar fógra forghníomhaithe a sheirbheáil ar Choimisinéir na nGardaí agus iachall a chur ar na Gardaí an fhaisnéis a ndearna tú iarratas uirthi a thabhairt duit
